Конфиг21/src/Documents/ВыпискаБанка/ВыпискаБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпискаБанка</name>
  <registerRecords>AccountingRegister.РегистрБухУчет</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <tabularSections>
    <name>ПриходДенежныхСредств</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходДенежныхСредств</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфиг21/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфиг21/src/AccountingRegisters/РегистрБухУчет/РегистрБухУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухУчет</name>
  <chartOfAccounts>ChartOfAccounts.БухгалтерскийУчет</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Конфиг21/src/ChartsOfAccounts/БухгалтерскийУчет/БухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухгалтерскийУчет</name>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>01.2</code>
      </childItems>
      <childItems>
        <name>РасчетныйСчет</name>
        <description>Расчетный счет</description>
        <code>01.3</code>
      </childItems>
      <childItems>
        <name>Себестоимость</name>
        <description>Себестоимость</description>
        <code>01.4</code>
      </childItems>
    </items>
    <items>
      <name>Пассивы</name>
      <description>Пассивы</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>02.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>02.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Конфиг21/src/Documents/ВыпискаБанка/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр Взаиморасчеты Приход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать = Истина;

	
	Для Каждого ТекСтрокаПриходДенежныхСредств Из ПриходДенежныхСредств Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаПриходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;
		// регистр РегистрБухУчет
		Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.Покупатели;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаПриходДенежныхСредств.Сумма;

	КонецЦикла;

	// регистр Взаиморасчеты Расход
	Движения.Взаиморасчеты.Записывать = Истина;
	Движения.РегистрБухУчет.Записывать = Истина;

	Для Каждого ТекСтрокаРасходДенежныхСредств Из РасходДенежныхСредств Цикл
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаРасходДенежныхСредств.Контрагент;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;
		// регистр РегистрБухУчет 
		          Движение = Движения.РегистрБухУчет.Добавить();
		Движение.СчетДт = ПланыСчетов.БухгалтерскийУчет.Поставщики;
		Движение.СчетКт = ПланыСчетов.БухгалтерскийУчет.РасчетныйСчет;
		ПланыСчетов.БухгалтерскийУчет.Себестоимость;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаРасходДенежныхСредств.Сумма;

	КонецЦикла;

	 
	
	
	 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
